{
  "id": "entitlements-management",
  "label": "PRICING & PACKAGING",
  "title": "Entitlements Management",
  "description": "Designed and launched a centralized entitlements service that became the foundation for trials, demos, and upsells. Introduced governed, time-bound access to eliminate revenue leakage, unlocking new monetization paths and mitigating **six-figure revenue loss** while **cutting support overhead in half** for improper feature access.",
  "year": 2024,
  "type": "paid",
  "tags": [
    "Platform",
    "Feature Access",
    "Lifecycle Management",
    "Experimentation"
  ],
  "featured": false,
  "thumbnail": "/assets/projects/entitlements-management/pricing-plans.png",
  "company": "DataRobot",
  "meta": {
    "role": "Product Manager -> Senior Product Manager",
    "company": "DataRobot",
    "timeline": "2+ years",
    "proudOf": "Turned access control into an extensible customer lifecycle management framework and a durable growth lever",
    "learned": "Strong platform foundations are required before growth and monetization can safely scale"
  },
  "metrics": [
    { "value": 100, "label": "REVENUE LEAKAGE ELIMINATED", "format": "${}Ks" },
    { "value": 50, "label": "SUPPORT TICKET REDUCTION", "format": "{}%" },
    { "value": 180, "label": "FEATURE FLAGS DEPRECATED", "format": "{}+" },
    { "value": 24, "label": "DEPLOYED TO PROD", "format": "{} SKUs" }
  ],
  "sections": [
    {
      "id": "problem",
      "type": "two-column",
      "label": "CONTEXT",
      "heading": "Problem and Hypothesis",
      "image": "/assets/projects/entitlements-management/entitlements-meme.png",
      "imageAlt": "Entitlements problem overview",
      "imagePosition": "right",
      "content": "As DataRobot scaled, feature access was controlled through a mix of hard-coded logic, feature flags, manual provisioning, and tribal knowledge spread across teams. \n\n Over-provisioned accounts retained access to increased compute capacity and paid features long after contracts ended, contributing to hundreds of thousands in annual leakage.\n\n Customers occasionally **lacked access to features they had purchased**, leading to confusion and support escalations.\n\nWe could not safely run trials, demos, or upsell experiments at scale because the whole setup was so brittle.\n\nI made the decision to build an entitlements management service that would remove the error-prone manual processes and improve governance. I believed that this would eliminate the revenue leakage and reduce the burden on support, all while laying the foundation for future growth motions."
    },
    {
      "id": "strategy",
      "type": "two-column",
      "label": "CORE",
      "heading": "Building Blocks",
      "image": "/assets/projects/entitlements-management/legos.png",
      "imageAlt": "Packaging and access strategy",
      "imagePosition": "left",
      "content": "I identified accounts that were in violation and began laying plans to ensure it couldn't happen again. In tandem, I started exploring ways that automated, governed access could be used to drive growth. \n\n **One source of truth** for feature access provides clarity to internal teams and customers.\n\n Entitlements should be **modular** and can be added/removed independently in designated quantities. \n\n A **time component** ensures that access is removed when no longer valid, eliminating manual cleanup.\n\n Teams can hook into **triggers** in the customer’s lifecycle to layer in additional actions."
    },
    {
      "id": "execution",
      "type": "two-column",
      "label": "ENTITLEMENTS MANAGEMENT",
      "heading": "Evolution Timeline",
      "image": "/assets/projects/entitlements-management/entitlements-timeline.png",
      "imageAlt": "Execution plan streams",
      "imagePosition": "right",
      "content": "\n\n**1. Defined the Entitlements Model**\n- Authored the long-term vision and core schema mapping for customers, phases, features, limits, and time-bound access.\n- Partnered closely with Engineering, Security, Support, and Analytics to clean up feature flag tech debt and ensure enforcement was auditable.\n\n**2. Proved It with Trials**\n- Replaced manual trial provisioning with governed entitlements.\n- Validated that features turned on and off correctly under real usage and cost constraints.\n\n**3. Extended to Sales-Led Demo Environments and Paid Customers**\n- Adopted entitlements for sales-led demo environments, reducing operational drag on support.\n- Extended the model to paid customers and used to provision 24 separate product SKUs.\n\n**4. Unlocked Reverse Trials**\n- Paying customers could now self-serve temporary access to premium features like Generative AI.\n- Added hooks to CRM to allow account teams to follow up."
    },
    {
      "id": "lessons-takeaways",
      "type": "highlight",
      "label": "TAKEAWAYS",
      "heading": "Lessons Learned",
      "image": "",
      "imageAlt": "Lessons and takeaways overview",
      "imagePosition": "right",
      "content": "This work was a major turning point for me. It was the first time I was able to truly connect the dots between platform work and revenue. \n\n I also learned that the devil is in the details. Wrangling the feature flags to pivot to entitlements was tedious and time-consuming. Motivating other teams to invest in this effort was difficult. In retrospect, **I wish I had garnered more top-level buy-in** from the start. It was a great lesson in humility and patience.",
      "bottomLine": "**Platform work compounds. When access is governed and enforceable, revenue can be protected while accelerating experimentation and self-serve growth.**"
    }
  ]
}
