{
  "id": "entitlements-management",
  "label": "ORGANIC EXPANSION",
  "title": "Entitlements Management — A Growth Platform Case Study",
  "description": "I led the design and launch of a centralized entitlements system that became the foundation for trials, demos, and monetization at DataRobot. By introducing governed, time-bound feature access, we eliminated $500K+ in revenue leakage and unlocked new growth motions — including reverse trials for paid customers.",
  "year": 2024,
  "type": "paid",
  "tags": [
    "Platform",
    "Authorization",
    "Feature Access",
    "Provisioning",
    "Packaging",
    "Billing",
    "Experimentation",
    "Technical"
  ],
  "featured": false,
  "thumbnail": "/assets/projects/entitlements-management/pricing-plans.png",
  "company": "DataRobot",
  "meta": {
    "role": "Senior Product Manager",
    "company": "DataRobot",
    "timeline": "~9 months",
    "proudOf": "Turning access control into a growth lever through reverse trials and self-serve experimentation",
    "learned": "Strong platform foundations are required before growth and monetization can safely scale"
  },
  "metrics": [
    { "value": 500, "label": "Revenue leakage eliminated (K)", "format": "${}K" },
    { "value": 50, "label": "Support tickets reduced", "format": "{}%" },
    { "value": 9, "label": "Months to launch", "format": "{} months" },
    { "value": 4, "label": "Execution streams", "format": "{} streams" }
  ],
  "sections": [
    {
      "id": "problem",
      "type": "two-column",
      "label": "FIRST PRINCIPLES APPROACH",
      "heading": "Problem and Hypothesis",
      "image": "/assets/projects/entitlements-management/entitlements-problem.png",
      "imageAlt": "Entitlements problem overview",
      "imagePosition": "left",
      "content": "As DataRobot scaled, feature access was controlled through a mix of hard-coded logic, feature flags, manual provisioning, and tribal knowledge spread across teams. This created significant business and growth challenges:\n\n- **Revenue leakage:** Over-provisioned accounts retained access to increased compute capacity and paid features long after contracts ended, contributing to hundreds of thousands in annual leakage.\n- **Customer friction:** Customers frequently lacked access to features they had purchased, leading to confusion and support escalations.\n- **Growth blocked:** We could not safely run trials, demos, or upsell experiments because feature access was brittle.\n\nI made the decision to build an entitlements management system that would remove the error-prone manual processes and improve governance. We believed that this would eliminate the revenue leakage while laying the foundation for future growth levers."
    },
    {
      "id": "strategy",
      "type": "two-column",
      "label": "GROWTH",
      "heading": "Strategy",
      "image": "/assets/projects/entitlements-management/entitlements-opp.png",
      "imageAlt": "Packaging and access strategy",
      "imagePosition": "right",
      "content": "I intentionally framed entitlements as a growth platform, not a backend refactor.\n\nCore principles:\n- **Single source of truth:** One authoritative system for feature access across all deployments.\n- **Time-bound access:** Every entitlement could expire automatically, removing manual cleanup.\n- **Future-proofed:** Designed to support use cases we hadn’t launched yet, including reverse trials and usage-based access.\n- **Lifecycle hooks:** Allowed teams to hook into specific triggers in the customer’s lifecycle — whether it be marketing outreach or even data deletion and removal when a customer churns."
    },
    {
      "id": "execution",
      "type": "two-column",
      "label": "ENTITLEMENTS MANAGEMENT",
      "heading": "Layered Execution",
      "image": "/assets/projects/entitlements-management/layered-capabilities.png",
      "imageAlt": "Execution plan streams",
      "imagePosition": "left",
      "content": "\n\n**1. Defined the Entitlements Model**\n- Authored the long-term vision and core schema mapping customers, users, features, limits, and time-bound access.\n- Partnered closely with Engineering, Security, Support, and Analytics to ensure enforcement was consistent and auditable.\n\n**2. Proved It with Trials**\n- Replaced manual trial provisioning with governed entitlements.\n- Validated that features turned on and off correctly under real usage and cost constraints.\n\n**3. Extended to Demo Environments and Paid Customers**\n- Rolled out the system across demos and paid SKUs, reducing operational drag across the org.\n- Extended the model to paid customers.\n- Sales and Customer Success could now offer \"try before you buy\" experiences to existing customers — safely.\n\n**4. Unlocked Reverse Trials**\n- Paying customers could now self-serve temporary access to premium features like Generative AI.\n- Added hooks to CRM to allow account teams to follow up.\n- Launched just before I departed the company."
    },
    {
      "id": "lessons-takeaways",
      "type": "highlight",
      "label": "TAKEAWAYS",
      "heading": "Lessons Learned",
      "image": "/assets/projects/placeholder.svg",
      "imageAlt": "Lessons and takeaways overview",
      "imagePosition": "right",
      "content": "The impact was immediate and durable:\n\n- **$500K in revenue leakage eliminated** by shutting off unused or mis-scoped resources.\n- **Support tickets related to underprovisioned resources cut in half.**\n- Trial and demo environments became faster to provision, more consistent, and easier to reason about.\n- Paid customers could temporarily self-serve premium features, unlocking a low-risk upsell motion that previously wasn’t possible.\n\nI learned that platform work compounds. Backend infrastructure can directly unlock revenue, experimentation velocity, and product-led expansion.",
      "bottomLine": "Platform work compounds: when access is governed and enforceable, you protect revenue while accelerating experimentation and self-serve growth."
    }
  ]
}
