{
  "id": "self-serve-trial",
  "label": "GROWTH & ONBOARDING",
  "title": "Self-Serve Trial for an Enterprise AI Platform",
  "description": "I led the launch of DataRobot's self-serve trial motion. In a six-month window, I redesigned the multi-tenant onboarding to support organic expansion, added social login to reduce friction, and introduced a streamlined trial experience that generated a 3X conversion rate improvement. The result was a scalable product-led growth motion that significantly boosted user acquisition and conversion through social signups, organic user invitations, and a tailored onboarding experience.",
  "year": 2022,
  "type": "paid",
  "tags": ["Sign Up Flow UI/UX", "Experimentation", "AI", "Growth"],
  "featured": true,
  "thumbnail": "/trial-hero.png",
  "company": "DataRobot",
  "meta": {
    "role": "Senior Product Manager",
    "company": "DataRobot",
    "timeline": "6 months",
    "proudOf": "Turning a complex enterprise AI platform into a first-session success for new users",
    "learned": "How to balance enterprise constraints with product-led growth"
  },
  "sections": [
    {
      "id": "problem",
      "type": "two-column",
      "label": "DISTILLING DOWN",
      "heading": "Problem and Hypothesis",
      "image": "/assets/projects/self-serve-trial/self-serve-trial-problem.png",
      "imageAlt": "Problem overview",
      "imagePosition": "left",
      "content": "DataRobot's previous trial prevented users from growing their team within the product. I believed that a trial which supported organic expansion within an existing tenant would help grow total user base and conversion rates."
    },
    {
      "id": "approach",
      "type": "two-column",
      "label": "BIAS TOWARDS ACTION",
      "heading": "Build and Learn",
      "image": "",
      "imageAlt": "Approach overview",
      "imagePosition": "right",
      "content": "I led the end-to-end trial launch, working beyond my team’s core product scope to align marketing, data, growth, and platform readiness. I delivered the trial signup flow, tenant provisioning, and UX improvements, including admin setup and inviting up to five users on the free tier. I instrumented the funnel to measure activation, engagement, and expansion, and partnered with users and data scientists to define trial limits and features. Finally, I collaborated with marketing on A/B-tested drip campaigns to drive trial conversion."
    },
    {
      "id": "results",
      "type": "two-column",
      "label": "THE",
      "heading": "Results",
      "image": "",
      "imageAlt": "Results overview",
      "imagePosition": "left",
      "content": "The new trial program had a major impact on user growth and revenue pipeline. It is still featured today as one of the first CTAs on DataRobot's website.\n\n- **2,500+ MAU:** Within a few months, trial usage exploded to over 2,500 monthly active users, dramatically expanding the top of our funnel.\n- **3× conversion uplift:** Trial-to-paid conversion rates jumped ~3× compared to the old approach. By removing friction, facilitating invites, and guiding users to value, far more trial users became paying customers. Importantly, trial workspaces with 3+ users showed much higher conversion, validating our focus on team onboarding.\n\nThe self-serve trial became a key lead source for sales. Trial engagement data helped identify high-intent accounts and armed sales with insights, turning the trial into a reliable lead-gen pipeline."
    },
    {
      "id": "lessons-learned",
      "type": "two-column",
      "label": "LESSONS",
      "heading": "Learned",
      "image": "",
      "imageAlt": "Lessons learned overview",
      "imagePosition": "right",
      "content": "- **Lesson 1:** Set a fast pace and others will follow\n- **Lesson 2:** Repeat key information over and over\n- **Lesson 3:** Run more experiments"
    }
  ]
}
