{
  "id": "self-serve-trial",
  "label": "GROWTH & ONBOARDING",
  "title": "Self-Serve Trial for an Enterprise AI Platform",
  "description": "I led the launch of DataRobot's self-serve trial motion. In a six-month window, I redesigned the multi-tenant onboarding to support organic expansion, added social login to reduce friction, and introduced a streamlined trial experience that generated a 3X conversion rate improvement. The result was a scalable product-led growth motion that significantly boosted user acquisition and conversion through social signups, organic user invitations, and a tailored onboarding experience.",
  "year": 2022,
  "type": "paid",
  "tags": ["Sign Up Flow UI/UX", "Experimentation", "AI", "Growth"],
  "featured": true,
  "thumbnail": "/assets/projects/self-serve-trial/trial-hero.png",
  "company": "DataRobot",
  "meta": {
    "role": "Senior Product Manager",
    "company": "DataRobot",
    "timeline": "6 months",
    "proudOf": "Extensive effort and collaboration required to turn a complex enterprise AI platform into a straightforward see-try-buy experience",
    "learned": "How to balance enterprise constraints with product-led growth"
  },
  "metrics": [
    { "value": 3, "label": "CONVERSION RATE BOOST", "format": "{}X" },
    { "value": 2500, "label": "MAU WITHIN 1 YEAR", "format": "{}+" },
    { "value": 6, "label": "TO LAUNCH", "format": "{} months" },
    { "value": 12, "label": "MAU FROM INVITES", "format": "{}%" }
  ],
  "sections": [
    {
      "id": "problem",
      "type": "two-column",
      "label": "DISTILLING DOWN",
      "heading": "Problem and Hypothesis",
      "image": "/assets/projects/self-serve-trial/self-serve-trial-problem.png",
      "imageAlt": "Problem overview",
      "imagePosition": "left",
      "content": "DataRobot's previous trial prevented users from growing in the product. It was a different experience and prohibited sharing projects with colleagues. \n\n I believed that a trial which **supported organic expansion** and helped users **see value faster** would result in a larger active user base and increased conversion rates."
    },
    {
      "id": "approach",
      "type": "two-column",
      "label": "DESIGNING FOR GROWTH",
      "heading": "Approach",
      "image": "/assets/projects/self-serve-trial/trial-preseed-v2.png",
      "imageAlt": "Approach overview",
      "imagePosition": "right",
      "content": "I led the end-to-end trial launch, working beyond my team’s core scope to align marketing, analytics, and platform readiness. \n\n I delivered the trial signup flow, provisioning, and UX improvements. By partnering with our analytics team to interpret the data, interviewing data scientist users, and running experiments, I defined key activation moments and designed the trial around them. \n\n I then ensured that these moments were instrumented so we could measure activation, engagement, and expansion."
    },
    {
      "id": "results",
      "type": "two-column",
      "label": "THE",
      "heading": "Results",
      "image": "/assets/projects/self-serve-trial/trial-results-v2.png",
      "imageAlt": "Results overview",
      "imagePosition": "left",
      "content": "The new trial program had a major impact on user growth and revenue pipeline. It is still featured today as one of the first CTAs on [DataRobot's marketing website](https://www.datarobot.com).\n\n- Trial usage grew from ~700 to over 2,500 monthly active users, dramatically expanding the top of our funnel.\n- Data analysis showed that workspaces with 3+ users had higher retention rates. Collaboration made the product sticky. I added a simple invite flow to help users grow their team and share projects. At it's peak, 12% of trial users had registered through an invite. \n- Trial-to-paid conversion rates jumped 3X compared to the old approach. By removing friction, facilitating invites, and guiding users to value, far more trial users became paying customers. \n\nThe self-serve trial became a key lead source for sales. Trial engagement data helped identify high-intent accounts and armed sales with insights, turning the trial into a reliable lead-gen pipeline."
    },
    {
      "id": "lessons-learned",
      "type": "highlight",
      "label": "TAKEAWAYS",
      "heading": "Lessons Learned",
      "content": "Trials should demonstrate value quickly by providing a clear path to **the first success**. In our case that was making a model prediction. We reduced that timeline by pre-seeding data and training a model as soon as the user signed up. By treating it like a game with levels, bringing more users to the party to foster collaboration, and instrumenting everything, we turned trial into a growth engine for the business. I deeply enjoyed this work and it is why I want to pursue a Growth role next.",
      "bottomLine": "**Optimize time-to-first-value and enable collaboration early. Those two levers can turn a trial into a durable growth engine.**"
    }
  ]
}
