{
  "id": "sts-launch",
  "label": "ENTERPRISE & SECURITY",
  "title": "Single-Tenant SaaS Launch",
  "description": "I led the 0→1 launch of a new single-tenant SaaS deployment model designed for enterprise and regulated customers who needed stronger isolation without losing SaaS velocity. I owned discovery, requirements, pricing inputs, and GTM enablement, turning a trust-and-compliance gap into a scalable product line that drove meaningful revenue impact.",
  "year": 2024,
  "type": "paid",
  "tags": ["Customer Discovery", "Cloud Infrastructure", "Compliance", "GTM Enablement"],
  "featured": false,
  "thumbnail": "/assets/projects/sts-launch/sts-castle.png",
  "company": "DataRobot",
  "meta": {
    "role": "Senior Product Manager",
    "company": "DataRobot",
    "timeline": "~12 months from discovery to launch",
    "proudOf": "Turned enterprise security needs into a repeatable product & sales motion",
    "learned": "Narrative clarity and early cross-functional alignment matter as much as technical correctness in executive-visible launches"
  },
  "metrics": [
    { "value": 45, "label": "CUSTOMERS", "format": "{}+" },    
    { "value": 3, "label": "CLOUD PROVIDERS", "format": "{}" },
    { "value": 20, "label": "ARR ATTRIBUTABLE", "format": "${}M+" },
    { "value": 5, "label": "COMPLIANCE CERTIFICATIONS", "format": "{}" }
  ],
  "sections": [
    {
      "id": "context",
      "type": "two-column",
      "label": "CONTEXT",
      "heading": "Opportunity Space",
      "image": "/assets/projects/sts-launch/graph.png",
      "imageAlt": "Deployment spectrum overview",
      "imagePosition": "left",
      "content": "DataRobot served two ends of the deployment spectrum.\n\n**1. Multi-tenant SaaS** provided fast feature delivery, uptime SLAs, easy collaboration, and many other benefits, but some customers needed stronger isolation guarantees.\n\n**2. On-prem** provided customers with strong isolation, but slow upgrades and heavy operational burden (Kubernetes, infra complexity, long deployment timelines).\n\nAfter a series of discovery interviews I determined that a growing segment of enterprise and regulated customers wanted **SaaS velocity with single-tenant security posture**. Without it, we were losing or stalling deals that required clearer guarantees around isolation, governance, and compliance."
    },
    {
      "id": "goals-and-success-criteria",
      "type": "two-column",
      "label": "PRODUCT",
      "heading": "Strategy",
      "image": "/assets/projects/sts-launch/sts-labeled-castle.png",
      "imageAlt": "Goals and success criteria overview",
      "imagePosition": "right",
      "content": "These deployments were operationally expensive. I positioned Single-Tenant SaaS as a *first-class product line*, not a one-off deployment exception.\n\n In tandem with that, we put security at the forefront of everything, providing isolation guarantees and a clear threat model. \n\n I developed a **castle analogy** to make the architecture intuitive and easy to explain to non-technical stakeholders. \n\n With this foundation we believed we'd be able to **unlock new enterprise and regulated revenue** we couldn’t win with existing deployment options."
    },
    {
      "id": "execution",
      "type": "two-column",
      "label": "HIPAA",
      "heading": "Compliance",
      "image": "/assets/projects/sts-launch/compliance.png",
      "imageAlt": "Execution overview",
      "imagePosition": "left",
      "content": "I drove delivery end-to-end across product, engineering, security, pricing, and GTM.\n\nThe initial customers were all large healthcare providers and required HIPAA compliance. \n\n I worked with the security and engineering teams to address any compliance gaps and attest that we were adhering with the HIPAA Security Rule."
    },
    {
      "id": "impact",
      "type": "two-column",
      "label": "GTM",
      "heading": "Launch and Enablement",
      "image": "/assets/projects/sts-launch/launch.png",
      "imageAlt": "Impact overview",
      "imagePosition": "right",
      "content": "I collaborated across multiple teams to deliver a successful launch.\n\n**Pricing**\n- Projected low / medium / high cost estimates across regions and cloud providers.\n- Identified cost-reduction techniques to further improve margins.\n\n**GTM enablement**\n- Created pitch decks, 1-pagers, positioning docs, FAQs, onboarding instructions, and security guides.\n- Supported active deal cycles, helping close and accelerate multiple six-figure contracts.\n\n **Impact**\n\n- Built brand trust in the industry. \n- Provided sellers with flexibility to meet customers with unique requirements, like data sovereignty.\n- The largest deal in company history was done on Single-Tenant SaaS."
    },
    {
      "id": "what-worked-what-id-improve",
      "type": "highlight",
      "label": "TAKEAWAYS",
      "heading": "Lessons Learned",
      "image": "/assets/projects/placeholder.svg",
      "imageAlt": "Retrospective overview",
      "imagePosition": "right",
      "content": "Treating STS as a true product line created clarity, ownership, and scalability. The security-first narrative made value obvious and differentiated us from “SaaS-only” competitors. In hindsight, I wish I pushed to invest earlier in self-service deployment tooling to reduce operational load.",
      "bottomLine": "**Enterprise growth often hinges on trust as much as features. The win wasn’t just shipping a different architecture, it was building a repeatable story + SKU + GTM motion that turned compliance needs into revenue.**"
    }
  ]
}
